Датасет: data/accounts.*csv<br>
В accounts.*.csv найти id, для которого в столбце ammount встречается наибольшее количество значений между 1000 и 1500. Выполнить задание с использованием Dask, распаралелив процесс обработки данных. Выполнить задание с использование Dask(корректным!), распаралелив процесс обработки данных (использование Dask должно приводить к истинной паралелльной обработке данных)

In [48]:
import dask.dataframe as dd

In [49]:
accounts = dd.read_csv('./data/accounts.*.csv', dtype={'amount': 'float64', 'id': 'int64', 'names': 'object'})
accounts

Dask DataFrame Structure:
                  id   names   amount
npartitions=6
               int64  object  float64
                 ...     ...      ...
...              ...     ...      ...
                 ...     ...      ...
                 ...     ...      ...
Dask Name: read-csv, 6 tasks

In [50]:
accounts_sorted = accounts[(accounts['amount'] >= 1000) & (accounts['amount'] <= 1500)]

In [51]:
accounts_sorted.groupby('id')['amount'].count().idxmax().compute()

485

### Проверка

In [52]:
result = accounts_sorted.groupby('id').count().sort_values("amount").compute()
result

     names  amount
id
435      1       1
82       1       1
167      1       1
346      1       1
198      2       2
..     ...     ...
15   24126   24126
398  26177   26177
367  29052   29052
238  29725   29725
485  67438   67438

[127 rows x 2 columns]